Revit 2027 API
PipeSettings.IsAnalysisForClosedLoopHydronicPipingNetworksEnabled Method
 Indicates whether analysis for closed loop hydronic piping networks is enabled in the specified document.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsAnalysisForClosedLoopHydronicPipingNetworksEnabled(
	Document ccda
)
Public Shared Function IsAnalysisForClosedLoopHydronicPipingNetworksEnabled (
	ccda As Document
) As Boolean
public:
static bool IsAnalysisForClosedLoopHydronicPipingNetworksEnabled(
	Document^ ccda
)
static member IsAnalysisForClosedLoopHydronicPipingNetworksEnabled :
        ccda : Document -> bool
Parameters
ccda Document
 The document.
Return Value
Boolean
 Returns true if analysis for closed loop hydronic piping networks is enabled, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace